sts-request.xml

 <soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope">
  <soap:Header>
    <Action xmlns="http://www.w3.org/2005/08/addressing">http://docs.oasis-open.org/ws-sx/ws-trust/200512/RST/Issue</Action>
    <MessageID xmlns="http://www.w3.org/2005/08/addressing">urn:uuid:73a215e3-1595-4ab3-bcda-c276df30c93b</MessageID>
    <To xmlns="http://www.w3.org/2005/08/addressing">https://iamwse.upvsfix.gov.sk:8581/sts/wss11x509</To>
    <ReplyTo xmlns="http://www.w3.org/2005/08/addressing">
      <Address>http://www.w3.org/2005/08/addressing/anonymous</Address>
    </ReplyTo>
    <wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" soap:mustUnderstand="true">
      <wsu:Timestamp wsu:Id="TS-f5ba58d8-0f23-4678-bfce-0bd7d36a33b3">
        <wsu:Created>2025-10-09T10:42:37.691Z</wsu:Created>
        <wsu:Expires>2025-10-09T10:47:37.691Z</wsu:Expires>
      </wsu:Timestamp>
      <wsse:BinarySecurityToken EncodingType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-soap-message-security-1.0#Base64Binary" ValueType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-x509-token-profile-1.0#X509v3" wsu:Id="X509-7f4869c8-d317-4065-971b-f2a8223dd406">MIIC0jCCAbqgAwIBAgIJAI6T3SIUD/bVMA0GCSqGSIb3DQEBDQUAMBcxFTATBgNVBAMTDGljby0xMTI2NDMyNjAeFw0yNTEwMDgxMjIxMzhaFw0yNzEwMDgxMjIxMzhaMBcxFTATBgNVBAMTDGljby0xMTI2NDMyNjCCASIwDQYJKoZIhvcNAQEBBQADggEPADCCAQoCggEBALrKdcRPxzF0jsZKpR3fysGH8yOO5dFsfA+aNYtb4kgAeTMJU20Jw9QC6ey/RHMwx+/T1xZDB7jlrvUO03YqHoWiOjUx5Y82DcGEtLrNF9FLzjqNZpCrm6h/9RMWwBRkUrIwGHy5f1tEM1y8pG7A3VZVIEBoaMC5hJ5fJUJvyK+h6CgX89PCZ0Fc+m3LHgrvTEfDIfDm+m5q0o1ft8tG3R7ThtQGI2b5oCZlbtz5iOq3ociH2cOiE+8B5BFkX+ZuDYwPUwZ7dczQ4vLAX7rjoK8DDcyEO9G5fKmUOaUk5TgsUoy6KZFcKnXAuIMdStoLXQgbHpFY7Et8wg5Y2w4Bf8cCAwEAAaMhMB8wHQYDVR0OBBYEFMsv4JhaZrDu2F2bks0Vl/zVy27MMA0GCSqGSIb3DQEBDQUAA4IBAQCT63lIVqXF3E1hOIN3gKA+zjyy2hraKgbkiCr5haKNwT46m5LEdbj+cp05HObs8xfXSCcDyMQ+rEouXzRSjjXWn43u2+M99fLRsu4q5SUlmfcSxH8fRMtbvv7MMQEcEqIlAr/iqTt3rihZ4Ui2L9MyKX+30o/XtzeWn4137aja2LA2ShVGo0GwxAjBXxMEqymo2iKcrEnn8FHLhyvnioNci5TwkFm8nlPbfPkBAeWzJGyRK3Vlf0AhMiLc/5xPxd0QRA1YW0rZvrK37DJ+X6CK6j4PY0MdQ4pDiZwrYWKAgNx4dXqiE84HF70fRtm2uzTXqUFnBQGajnGNdTF591X9</wsse:BinarySecurityToken>
      <ds:Signature xmlns:ds="http://www.w3.org/2000/09/xmldsig#" Id="SIG-0a554075-09e3-4af0-9ff4-d377d0938e69">
        <ds:SignedInfo>
          <ds:CanonicalizationMethod Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#">
            <ec:InclusiveNamespaces xmlns:ec="http://www.w3.org/2001/10/xml-exc-c14n#" PrefixList="soap"/>
          </ds:CanonicalizationMethod>
          <ds:SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#rsa-sha1"/>
          <ds:Reference URI="#TS-f5ba58d8-0f23-4678-bfce-0bd7d36a33b3">
            <ds:Transforms>
              <ds:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#">
                <ec:InclusiveNamespaces xmlns:ec="http://www.w3.org/2001/10/xml-exc-c14n#" PrefixList="wsse soap"/>
              </ds:Transform>
            </ds:Transforms>
            <ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/>
            <ds:DigestValue>FSZQcu5IWGBJnJdy2MAoBpE7OOs=</ds:DigestValue>
          </ds:Reference>
          <ds:Reference URI="#_4051655c-2310-4827-9362-f5a0eca09b4c">
            <ds:Transforms>
              <ds:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"/>
            </ds:Transforms>
            <ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/>
            <ds:DigestValue>LXY6ZB1F/X6hRZpXKsIrau5SCm4=</ds:DigestValue>
          </ds:Reference>
        </ds:SignedInfo>
        <ds:SignatureValue>Mu0CooLqbLIwTA4AtMgs07wbemVMnkE8WdciSallZENmllgwsnWaa3c6SRAWcjxPWE+pJ3BlgHAumo06KaH0X9A/WWhA5Azg2GKqYu6Ci4A+bkD2X1Li7TRpMXEK1hWA87R02EHcaa3CwZqxS6i6yLcPwF+9ToYy5LnSX61E0iQcPj5pjHo/to3g/R+mXTtivu4rRdmPnDw8+fv8ou7yBB/BaA4WK7iuun5YeRkSZBlqnnd5qiDzVjNsCwVPS1VVCXSBpK0hSPtRhiN9C8Nxe8rZezXYSCa8VMlmekGHPi9JZuaNHZ6SS2UlUHamVlhfwM2i9FqBu9FyeI9NIa6kpw==</ds:SignatureValue>
        <ds:KeyInfo Id="KI-be96acba-b48f-4395-b3a9-43b384b43808">
          <wsse:SecurityTokenReference xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" wsu:Id="STR-b0ba33a0-046d-4e5c-9b79-f822b75b2d8e">
            <wsse:Reference URI="#X509-7f4869c8-d317-4065-971b-f2a8223dd406" ValueType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-x509-token-profile-1.0#X509v3"/>
          </wsse:SecurityTokenReference>
        </ds:KeyInfo>
      </ds:Signature>
    </wsse:Security>
  </soap:Header>
  <soap:Body xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" wsu:Id="_4051655c-2310-4827-9362-f5a0eca09b4c">
    <wst:RequestSecurityToken xmlns:wst="http://docs.oasis-open.org/ws-sx/ws-trust/200512">
      <wst:SecondaryParameters>
        <trust:TokenType xmlns:trust="http://docs.oasis-open.org/ws-sx/ws-trust/200512">http://docs.oasis-open.org/wss/oasis-wss-saml-token-profile-1.1#SAMLV2.0</trust:TokenType>
        <trust:KeyType xmlns:trust="http://docs.oasis-open.org/ws-sx/ws-trust/200512">http://docs.oasis-open.org/ws-sx/ws-trust/200512/Bearer</trust:KeyType>
        <trust:SecondaryParameters xmlns:trust="http://docs.oasis-open.org/ws-sx/ws-trust/200512">
                  
          <trust:TokenType>http://docs.oasis-open.org/wss/oasis-wss-saml-token-profile-1.1#SAMLV2.0</trust:TokenType>
                  
          <trust:KeyType>http://docs.oasis-open.org/ws-sx/ws-trust/200512/Bearer</trust:KeyType>
                
        </trust:SecondaryParameters>
      </wst:SecondaryParameters>
      <wst:RequestType>http://docs.oasis-open.org/ws-sx/ws-trust/200512/Issue</wst:RequestType>
      <wsp:AppliesTo xmlns:wsp="http://schemas.xmlsoap.org/ws/2004/09/policy">
        <wsa:EndpointReference xmlns:wsa="http://www.w3.org/2005/08/addressing">
          <wsa:Address>https://usr.upvsfixnew.gov.sk/ServiceBus/ServiceBusToken.svc</wsa:Address>
        </wsa:EndpointReference>
      </wsp:AppliesTo>
    </wst:RequestSecurityToken>
  </soap:Body>
</soap:Envelope>

